# 递归练习
    # 遍历文件夹下的所有文件 ------ 掌握
    # 查看文件夹的总大小 --------- 看懂并知道实现方法
    # 斐波那契数列 ----------- 会写
    # 三级菜单 --------- 看懂并知道实现方法

    # 二分查找 [1,2,3,4,5,6,7,8,9,10,27,36,46,28,67] - 有序列表
        # in index 从列表中找到一个值的位置


# sys
    # sys.path
    # sys.argy  执行python脚本的时候 写python之后的所有的内容，形成一个列表
    # sys.modules  查看已经加载到内存中的所有文件
# os
    # 和文件 文件夹相关的
    # 和工作目录相关的
    # 和执行操作系统命令相关的
    # .path系列
# logging
    # 排错，数据分析，操作审计
    # 普通的输出（文件\屏幕）
    # 切分日志（时间/文件大小）
# shutil
    # 和文件相关的内容


# 算法
# 二分查找 [1,2,3,4,5,6,7,8,9,10,27,36,46,28,67] - 有序列表
# in index 从列表中找到一个值的位置
# 实现上面的功能 - 用代码



# sys.argy练习
# 写一个python脚本，在cmd里执行
# python xxx.py 用户名 密码 cp 文件路径 目的地址




# 使用walk来计算文件夹的总大小
# import os
# g = os.walk('F:\python')
# for i in g:
#     path,dir_lst,name_lst = i
#     print(path,name_lst)
