# 后台/后端
    # 复杂的代码 隐藏在后端
# 前端
    # 返回到前端 装饰一下 给别人看

# python基础
    # 后端程序的开发
        # 数据的处理（增删改查）
# 员工信息表，选课系统
    # 使用python和文件一起写程序的弊端
        # 结果不好看 需要在控制台，终端控制
        # 文件的处理非常繁琐：增加 删除


# 帮助你 管理 存储了数据的文件
    # 更加方便，快捷的实现数据的增，删，改，查

# python + 数据库(存取数据) + 文件(记录日志)

# 结果不好看 需要在控制台，终端控制


# 关系型数据库和非关系型数据库
    # 一条数据包含了一个事物的多条信息，这些信息之间是有关联的
# 非关系型
    # k-v
    # id content


# 关系型数据库
    # mysql  开源的
    # oracle   企业级
    # sqlite  轻量级
    # sql server  大学
# 非关系型数据库：消息转发
    # memcache
    # redis
    # mongoDB
    # nosql